Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/evidence/privileged_evidence.html.txt.tmx
Source language: en
Languages: ga

source: The doctrine of privilege allows you to refuse to disclose documents to the court and to refuse to answer certain questions even when those documents or questions are relevant to the case
ga: De réir na rialacha a bhaineann le fianaise phribhléide is féidir leat diúltú cáipéisí a chur ar fáil don chúirt agus ceisteanna faoi leith a fhreagairt fiú nuair a bhaineann na cáipéisí agus na ceisteanna sin leis an gcás

source: There are two main types of privilege:
ga: Tá dhá phríomhchineál pribhléide ann:

source: You have a "privilege against self-incrimination"
ga: Tá pribhléid i gcoinne féin-chiontaithe ag duine

source: This means that you can refuse to answer questions or hand over documents that may implicate you in criminal proceedings
ga: Is féidir leat diúltú ceisteanna a fhreagairt nó cáipéisí a thabhairt suas a d'fhéadfadh tú féin a lua le coir

source: You may have a "legal professional privilege"
ga: D'fhéadfadh sé go bhfuil pribhléid den ghairm dlíthiúil agat

source: A legal advisor and his or her client cannot be forced to disclose communications between them
ga: Ní féidir iallach a chur ar chomhairleoir dlí ná ar a c(h)liant aon eolas a d'inis siad dhá chéile a chur ar fáil

source: In addition, if any communication is made in contemplation of litigation (i.e., with a court case in mind), then that communication is privileged even if it is not a communication between lawyer and client
ga: Chomh maith leis sin má dhéantar aon chumarsáid ag súil le dul chun dlí (i.e., le cás cúirte ar intinn), baineann pribhléid leis an gcumarsáid sin fiú más daoine eile seachas dlíodóir agus cliant a bhí i gceist

source: Priests are allowed to refuse to answer questions relating to what was said in the confessional
ga: Tá sé de cheart ag sagairt diúltú ceisteanna a fhreagairt maidir le rudaí a dúradh leo sa bhosca faoistine

source: This is known as the "sacerdotal privilege"
ga: Tugtar pribhléid sagartúil ar seo

source: Similarly, communications with a counsellor may also be privileged
ga: Chomh maith leis sin, d'fhéadfadh comhráite le comhairleoir a bheith faoi phribhléid freisin

source: This is privilege claimed by the State
ga: Is pribhléid í seo a éilíonn an Stát

source: In some very limited circumstances, the State may refuse to disclose information or documents in order to protect the public interest
ga: I gcúinsí fíortheoranta is féidir leis an Stát diúltú eolas nó cáipéisí a chur ar fáil ar mhaithe le leasa an phobail a chosaint

source: For example, documents relating to the structure and engineering of army equipment might be held to be privileged in order to protect national security
ga: Mar shampla, d'fhéadfaí cáipéisí a bhaineann le structúr agus innealtóireacht trealaimh an airm a choinneáil faoi rún ar mhaithe leis an tslandáil náisiúnta a chosaint

source: For more detailed information you should seek legal advice
ga: Ba chóir duit comhairle dlí a lorg chun faisnéis mionsonraithe a fháil
